---
title: WireType
classe: Autodesk.Revit.DB.Electrical.WireType
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.ElementType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# WireType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `WireConduitType Conduit { get; set; }` | `wireType.Conduit` | WireConduitType |
| `InsulationType Insulation { get; set; }` | `wireType.Insulation` | InsulationType |
| `Boolean IsInUse { get; }` | `wireType.IsInUse` | Boolean |
| `WireSize MaxSize { get; set; }` | `wireType.MaxSize` | WireSize |
| `Double NeutralMultiplier { get; set; }` | `wireType.NeutralMultiplier` | Double |
| `Boolean NeutralRequired { get; set; }` | `wireType.NeutralRequired` | Boolean |
| `NeutralMode NeutralSize { get; set; }` | `wireType.NeutralSize` | NeutralMode |
| `TemperatureRatingType TemperatureRating { get; set; }` | `wireType.TemperatureRating` | TemperatureRatingType |
| `WireMaterialType WireMaterial { get; set; }` | `wireType.WireMaterial` | WireMaterialType |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```